[
  "templater-obsidian",
  "quickadd",
  "table-editor-obsidian",
  "obsidian-advanced-uri",
  "calendar-beta",
  "dataview",
  "obsidian-excalidraw-plugin",
  "obsidian-linter",
  "obsidian-tasks-plugin",
  "omnisearch",
  "obsidian-shellcommands"
]